notes/week4/textbook/distributed_computing.org
#+TITLE: Distributed Computing (Van Steen) Ch. 1 Notes
* Chapter 1: Introduction
** Summary
*** Distributed systems are a network of computing elements that get abstracted into a single coherent system.
**** The network can be made up of different nodes with different computing power and connectivity.
**** The coherent system should be transparent.  That is, the details are abstracted away.
***** Analogy: Unix Filesystem, where files, devices, buffers, and any other hardware component is abstracted as a file.
*** In designing the distributed system, you should consider the transparency and scalability.
**** There are different dimensions in transparency (the details in the network).
***** Data location (and relocation), data replication, concurrency, failure, and data access.
***** You might design a system to be *not* transparent.
****** That way, the user has better context and can understand if a node went down, etc.
******* Like a REST 500 error.
**** There are different aspects of scalability.
***** Adding more users / load, but also geographical scalability (different regions) and adminstrator (different admins) scalability.
****** For example, AWS has many 'admins' on at once (different users) with different regions.
*** Implemention is really complex.  But generally, there are different subsystems for different needs.
**** Can't make optimistic assumptions.
***** We think our system has a secure, reliable network, with the same structure of nodes, with zero latency and no bandwith costs.  Network costs are free.  And with one admin.
****** In real life, we can't make those assumptions.  Think the internet.  Insecure, unreliable, multiple admins, expensive network.
**** How do we run jobs on individual nodes?
***** RPC (Remote Controlled Procedure).
****** Since RPC needs both the caller and the runner to be available, middleware that holds the information, called messaging middleware, is important.
******* e.g. Logging distributed systems, like Apache Kafka or RabbitMQ.
**** How to we store, get, and update data?
***** With ACID transactions.
****** Similar to a Relational DB, transactions group a query together so that the transaction is atomic, consistent, isolated, and durable.
**** How do we scale up?
***** We can hide communication latencies (no idle CPU time) by using asynchronous requests, batching requests, and often in parallel.
***** We can shard a system, splitting the data or functionality into smaller parts.
****** Ex. The DNS system shards the .com or .edu to different subsystems called zones.
***** We might need to replicate data to ensure availablity, sinced scaled nodes cause more opportunity for failure.
****** Problem: Negative feedback loop, more replication needs more nodes, which can cause a higher likelihood of failure.
****** Problem: Need to maintain consistency between different stores.
