notes/week4/textbook/distributed_computing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Distributed Computing (Van Steen) Ch. 1 Notes</title>
<!-- 2017-09-22 Fri 23:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Yinwei (Charlie) Zhang" />
</head>
<body>
<div id="content">
<h1 class="title">Distributed Computing (Van Steen) Ch. 1 Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Chapter 1: Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Summary</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Distributed systems are a network of computing elements that get abstracted into a single coherent system.</a></li>
<li><a href="#sec-1-1-2">1.1.2. In designing the distributed system, you should consider the transparency and scalability.</a></li>
<li><a href="#sec-1-1-3">1.1.3. Implemention is really complex.  But generally, there are different subsystems for different needs.</a></li>
<li><a href="#sec-1-1-4">1.1.4. There many different distributed systems today, from high performance computing (HPC) to clusters to cloud computing to "persuasive" computing.</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Thoughts</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. What about the web and REST?  Isn't it the de facto or most popular distributed systems protocol in commerical services / cloud?</a></li>
<li><a href="#sec-1-2-2">1.2.2. Immutable State.</a></li>
<li><a href="#sec-1-2-3">1.2.3. CAP theorem and ACID and distributed databases.  How do they all work together?</a></li>
<li><a href="#sec-1-2-4">1.2.4. How is transparency linked with assumptions?</a></li>
<li><a href="#sec-1-2-5">1.2.5. EXTRA: What about microservices?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Chapter 1: Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Summary</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Distributed systems are a network of computing elements that get abstracted into a single coherent system.</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><ol class="org-ol"><li><a id="sec-1-1-1-1" name="sec-1-1-1-1"></a>The network can be made up of different nodes with different computing power and connectivity.<br  /></li>
<li><a id="sec-1-1-1-2" name="sec-1-1-1-2"></a>The coherent system should be transparent.  That is, the details are abstracted away.<br  /><ol class="org-ol"><li><a id="sec-1-1-1-2-1" name="sec-1-1-1-2-1"></a>Analogy: Unix Filesystem, where files, devices, buffers, and any other hardware component is abstracted as a file.<br  /></li></ol>
</li></ol>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> In designing the distributed system, you should consider the transparency and scalability.</h4>
<div class="outline-text-4" id="text-1-1-2">
</div><ol class="org-ol"><li><a id="sec-1-1-2-1" name="sec-1-1-2-1"></a>There are different dimensions in transparency (the details in the network).<br  /><ol class="org-ol"><li><a id="sec-1-1-2-1-1" name="sec-1-1-2-1-1"></a>Data location (and relocation), data replication, concurrency, failure, and data access.<br  /></li>
<li><a id="sec-1-1-2-1-2" name="sec-1-1-2-1-2"></a>You might design a system to be <b>not</b> transparent.<br  /><ol class="org-ol"><li><a id="sec-1-1-2-1-2-1" name="sec-1-1-2-1-2-1"></a>That way, the user has better context and can understand if a node went down, etc.<br  /><ol class="org-ol"><li><a id="sec-1-1-2-1-2-1-1" name="sec-1-1-2-1-2-1-1"></a>Like a REST 500 error.<br  /></li></ol>
</li></ol>
</li></ol>
</li>
<li><a id="sec-1-1-2-2" name="sec-1-1-2-2"></a>There are different aspects of scalability.<br  /><ol class="org-ol"><li><a id="sec-1-1-2-2-1" name="sec-1-1-2-2-1"></a>Adding more users / load, but also geographical scalability (different regions) and adminstrator (different admins) scalability.<br  /><ol class="org-ol"><li><a id="sec-1-1-2-2-1-1" name="sec-1-1-2-2-1-1"></a>For example, AWS has many 'admins' on at once (different users) with different regions.<br  /></li></ol>
</li></ol>
</li></ol>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Implemention is really complex.  But generally, there are different subsystems for different needs.</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><ol class="org-ol"><li><a id="sec-1-1-3-1" name="sec-1-1-3-1"></a>Can't make optimistic assumptions.<br  /><ol class="org-ol"><li><a id="sec-1-1-3-1-1" name="sec-1-1-3-1-1"></a>We think our system has a secure, reliable network, with the same structure of nodes, with zero latency and no bandwith costs.  Network costs are free.  And with one admin.<br  /><ol class="org-ol"><li><a id="sec-1-1-3-1-1-1" name="sec-1-1-3-1-1-1"></a>In real life, we can't make those assumptions.  Think the internet.  Insecure, unreliable, multiple admins, expensive network.<br  /></li></ol>
</li></ol>
</li>
<li><a id="sec-1-1-3-2" name="sec-1-1-3-2"></a>How do we run jobs on individual nodes?<br  /><ol class="org-ol"><li><a id="sec-1-1-3-2-1" name="sec-1-1-3-2-1"></a>RPC (Remote Controlled Procedure).<br  /><ol class="org-ol"><li><a id="sec-1-1-3-2-1-1" name="sec-1-1-3-2-1-1"></a>Since RPC needs both the caller and the runner to be available, middleware that holds the information, called messaging middleware, is important.<br  /><ol class="org-ol"><li><a id="sec-1-1-3-2-1-1-1" name="sec-1-1-3-2-1-1-1"></a>e.g. Logging distributed systems, like Apache Kafka or RabbitMQ.<br  /></li></ol>
</li></ol>
</li></ol>
</li>
<li><a id="sec-1-1-3-3" name="sec-1-1-3-3"></a>How to we store, get, and update data?<br  /><ol class="org-ol"><li><a id="sec-1-1-3-3-1" name="sec-1-1-3-3-1"></a>With ACID transactions.<br  /><ol class="org-ol"><li><a id="sec-1-1-3-3-1-1" name="sec-1-1-3-3-1-1"></a>Similar to a Relational DB, transactions group a query together so that the transaction is atomic, consistent, isolated, and durable.<br  /></li></ol>
</li></ol>
</li>
<li><a id="sec-1-1-3-4" name="sec-1-1-3-4"></a>How do we scale up?<br  /><ol class="org-ol"><li><a id="sec-1-1-3-4-1" name="sec-1-1-3-4-1"></a>We can hide communication latencies (no idle CPU time) by using asynchronous requests, batching requests, and often in parallel.<br  /></li>
<li><a id="sec-1-1-3-4-2" name="sec-1-1-3-4-2"></a>We can shard a system, splitting the data or functionality into smaller parts.<br  /><ol class="org-ol"><li><a id="sec-1-1-3-4-2-1" name="sec-1-1-3-4-2-1"></a>Ex. The DNS system shards the .com or .edu to different subsystems called zones.<br  /></li></ol>
</li>
<li><a id="sec-1-1-3-4-3" name="sec-1-1-3-4-3"></a>We might need to replicate data to ensure availablity, sinced scaled nodes cause more opportunity for failure.<br  /><ol class="org-ol"><li><a id="sec-1-1-3-4-3-1" name="sec-1-1-3-4-3-1"></a>Problem: Negative feedback loop, more replication needs more nodes, which can cause a higher likelihood of failure.<br  /></li>
<li><a id="sec-1-1-3-4-3-2" name="sec-1-1-3-4-3-2"></a>Problem: Need to maintain consistency between different stores.<br  /></li></ol>
</li></ol>
</li></ol>
</div>
