notes/week4/textbook/distributed_computing.tex
% Created 2017-09-22 Fri 23:32
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Yinwei (Charlie) Zhang}
\date{\today}
\title{Distributed Computing (Van Steen) Ch. 1 Notes}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Chapter 1: Introduction}
\label{sec-1}
\subsection{Summary}
\label{sec-1-1}
\subsubsection{Distributed systems are a network of computing elements that get abstracted into a single coherent system.}
\label{sec-1-1-1}
\begin{enumerate}
\item The network can be made up of different nodes with different computing power and connectivity.
\label{sec-1-1-1-1}
\item The coherent system should be transparent.  That is, the details are abstracted away.
\label{sec-1-1-1-2}
\begin{enumerate}
\item Analogy: Unix Filesystem, where files, devices, buffers, and any other hardware component is abstracted as a file.
\label{sec-1-1-1-2-1}
\end{enumerate}
\end{enumerate}
\subsubsection{In designing the distributed system, you should consider the transparency and scalability.}
\label{sec-1-1-2}
\begin{enumerate}
\item There are different dimensions in transparency (the details in the network).
\label{sec-1-1-2-1}
\begin{enumerate}
\item Data location (and relocation), data replication, concurrency, failure, and data access.
\label{sec-1-1-2-1-1}
\item You might design a system to be \textbf{not} transparent.
\label{sec-1-1-2-1-2}
\begin{enumerate}
\item That way, the user has better context and can understand if a node went down, etc.
\label{sec-1-1-2-1-2-1}
\begin{enumerate}
\item Like a REST 500 error.
\label{sec-1-1-2-1-2-1-1}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\item There are different aspects of scalability.
\label{sec-1-1-2-2}
\begin{enumerate}
\item Adding more users / load, but also geographical scalability (different regions) and adminstrator (different admins) scalability.
\label{sec-1-1-2-2-1}
\begin{enumerate}
\item For example, AWS has many 'admins' on at once (different users) with different regions.
\label{sec-1-1-2-2-1-1}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsubsection{Implemention is really complex.  But generally, there are different subsystems for different needs.}
\label{sec-1-1-3}
\begin{enumerate}
\item Can't make optimistic assumptions.
\label{sec-1-1-3-1}
\begin{enumerate}
\item We think our system has a secure, reliable network, with the same structure of nodes, with zero latency and no bandwith costs.  Network costs are free.  And with one admin.
\label{sec-1-1-3-1-1}
\begin{enumerate}
\item In real life, we can't make those assumptions.  Think the internet.  Insecure, unreliable, multiple admins, expensive network.
\label{sec-1-1-3-1-1-1}
\end{enumerate}
\end{enumerate}
\item How do we run jobs on individual nodes?
\label{sec-1-1-3-2}
\begin{enumerate}
\item RPC (Remote Controlled Procedure).
\label{sec-1-1-3-2-1}
\begin{enumerate}
\item Since RPC needs both the caller and the runner to be available, middleware that holds the information, called messaging middleware, is important.
\label{sec-1-1-3-2-1-1}
\begin{enumerate}
\item e.g. Logging distributed systems, like Apache Kafka or RabbitMQ.
\label{sec-1-1-3-2-1-1-1}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\item How to we store, get, and update data?
\label{sec-1-1-3-3}
\begin{enumerate}
\item With ACID transactions.
\label{sec-1-1-3-3-1}
\begin{enumerate}
\item Similar to a Relational DB, transactions group a query together so that the transaction is atomic, consistent, isolated, and durable.
\label{sec-1-1-3-3-1-1}
\end{enumerate}
\end{enumerate}
\item How do we scale up?
\label{sec-1-1-3-4}
\begin{enumerate}
\item We can hide communication latencies (no idle CPU time) by using asynchronous requests, batching requests, and often in parallel.
\label{sec-1-1-3-4-1}
\item We can shard a system, splitting the data or functionality into smaller parts.
\label{sec-1-1-3-4-2}
\begin{enumerate}
\item Ex. The DNS system shards the .com or .edu to different subsystems called zones.
\label{sec-1-1-3-4-2-1}
\end{enumerate}
\item We might need to replicate data to ensure availablity, sinced scaled nodes cause more opportunity for failure.
\label{sec-1-1-3-4-3}
\begin{enumerate}
\item Problem: Negative feedback loop, more replication needs more nodes, which can cause a higher likelihood of failure.
\label{sec-1-1-3-4-3-1}
\item Problem: Need to maintain consistency between different stores.
\label{sec-1-1-3-4-3-2}
\end{enumerate}
\end{enumerate}
\end{enumerate}
