notes/week4/textbook/distributed_computing.html
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> There many different distributed systems today, from high performance computing (HPC) to clusters to cloud computing to "persuasive" computing.</h4>
<div class="outline-text-4" id="text-1-1-4">
</div><ol class="org-ol"><li><a id="sec-1-1-4-1" name="sec-1-1-4-1"></a>HPC do simuations, solve complex math problems (tensors?), do machine learning, etc.<br  /><ol class="org-ol"><li><a id="sec-1-1-4-1-1" name="sec-1-1-4-1-1"></a>Can be implemented as a cluster (homogenous network, where the hardware is similar) or as a grid (a collection of different computer systems with different owners, hardware, and software).<br  /></li></ol>
</li>
<li><a id="sec-1-1-4-2" name="sec-1-1-4-2"></a>Cloud computing provides a service, whether thats an Infrastructure, Platform, or Software (IaaS, Paas, SaaS).  These services are rented out like an utility (like water), or X per node-hour.<br  /><ol class="org-ol"><li><a id="sec-1-1-4-2-1" name="sec-1-1-4-2-1"></a>Infrastructure is the physical datacenters, which aren't marketed.  Usually done by the DevOps team.<br  /></li>
<li><a id="sec-1-1-4-2-2" name="sec-1-1-4-2-2"></a>Platforms let you setup workflows and systems up.  Like AWS EC2, which lets you set up VMs, or AWS S3, which let you upload blobs (pictures, videos).<br  /></li>
<li><a id="sec-1-1-4-2-3" name="sec-1-1-4-2-3"></a>Software provides a human used program, like Dropbox or Youtube.<br  /></li></ol>
</li>
<li><a id="sec-1-1-4-3" name="sec-1-1-4-3"></a>Persuasive systems are computers that are everywhere, like sensors or mobile networks.<br  /><ol class="org-ol"><li><a id="sec-1-1-4-3-1" name="sec-1-1-4-3-1"></a>An extreme is the ubiqutous system, which is everywhere and always connected (think smarthome?)<br  /><ol class="org-ol"><li><a id="sec-1-1-4-3-1-1" name="sec-1-1-4-3-1-1"></a>Design requirements include distribution, interaction, context awareness, autonomy, and intelligence.<br  /></li></ol>
</li>
<li><a id="sec-1-1-4-3-2" name="sec-1-1-4-3-2"></a>Mobile networks can make ad hoc wireless networks (MANET), where they act as nodes.<br  /></li>
<li><a id="sec-1-1-4-3-3" name="sec-1-1-4-3-3"></a>Sensor networks can either send all their data back, or hold data and respond to queries (save energy).  Or there might be an intermediate processing system.<br  /></li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Thoughts</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> What about the web and REST?  Isn't it the de facto or most popular distributed systems protocol in commerical services / cloud?</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>In the book, Van Steen brought up RPCs and SOAs (server oriented architecture, next chapter), where nodes run functions.  I remember at Walmart working on their backend distributed system, and they were moving away from RPCs which built SOAs.  Instead every service was a ROA (resource oriented architecture) and the server was a RESTful API.<br  /></li>
<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>So we had microservices communicated with each other through REST.  The way nodes work on the web today is primarily through restful APIs.  Github API.  Facebook API (even though it's graphbased, we query through REST).<br  /></li>
<li><a id="sec-1-2-1-3" name="sec-1-2-1-3"></a>With startups, we encouraged to use the the cloud (AWS, Firebase) as our platform backend.  And the way the client connects (as a node to the system) is through REST.<br  /></li>
<li><a id="sec-1-2-1-4" name="sec-1-2-1-4"></a>So how come its not mentioned at all?<br  /></li></ol>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Immutable State.</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>The idea is that every data structure is immutable, so a change in state results in an entirely new state.  With that, you sacrifice some efficiency (allocated new objects or at least a ledger diff) but you have immutable state.  Which makes dealing with concurrency a lot easier.  Managing consistency becomes easier.<br  /></li>
<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>I know Facebook and their web platform (Redux, Immutable.js) uses it to make ReactJS much easier to develop in.<br  /></li>
<li><a id="sec-1-2-2-3" name="sec-1-2-2-3"></a>How come we don't see immutable distributed databases out there (Google showed me DAtomic)?<br  /></li></ol>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> CAP theorem and ACID and distributed databases.  How do they all work together?</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="sec-1-2-3-1" name="sec-1-2-3-1"></a>Like if we sacrifice C, they by definition our database isn't consistent, so no ACID.<br  /></li>
<li><a id="sec-1-2-3-2" name="sec-1-2-3-2"></a>So acid distributed databases are either outdated (availablitity) or slow (lack or partition tolerance?)<br  /></li>
<li><a id="sec-1-2-3-3" name="sec-1-2-3-3"></a>Might be for later&#x2026;<br  /></li></ol>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> How is transparency linked with assumptions?</h4>
<div class="outline-text-4" id="text-1-2-4">
</div><ol class="org-ol"><li><a id="sec-1-2-4-1" name="sec-1-2-4-1"></a>In the introduction, Van Steen stated that total transparency (network completely abstracted away) is impossible and sometimes a bad idea.<br  /></li>
<li><a id="sec-1-2-4-2" name="sec-1-2-4-2"></a>Is that related to the assumptions we make when designing a distributed system?<br  /></li>
<li><a id="sec-1-2-4-3" name="sec-1-2-4-3"></a>For example: If we have a unreliable network, expose the that part (connections, failure) of and intransparent and let the app / user deal with it<br  /><ol class="org-ol"><li><a id="sec-1-2-4-3-1" name="sec-1-2-4-3-1"></a>Ex: A website is taking too long to load, so the app displays a loading symbol, so the user understands and can close.<br  /></li></ol>
</li></ol>
</div>
<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> EXTRA: What about microservices?</h4>
