notes/week4/textbook/distributed_computing.tex
\subsubsection{There many different distributed systems today, from high performance computing (HPC) to clusters to cloud computing to "persuasive" computing.}
\label{sec-1-1-4}
\begin{enumerate}
\item HPC do simuations, solve complex math problems (tensors?), do machine learning, etc.
\label{sec-1-1-4-1}
\begin{enumerate}
\item Can be implemented as a cluster (homogenous network, where the hardware is similar) or as a grid (a collection of different computer systems with different owners, hardware, and software).
\label{sec-1-1-4-1-1}
\end{enumerate}
\item Cloud computing provides a service, whether thats an Infrastructure, Platform, or Software (IaaS, Paas, SaaS).  These services are rented out like an utility (like water), or X per node-hour.
\label{sec-1-1-4-2}
\begin{enumerate}
\item Infrastructure is the physical datacenters, which aren't marketed.  Usually done by the DevOps team.
\label{sec-1-1-4-2-1}
\item Platforms let you setup workflows and systems up.  Like AWS EC2, which lets you set up VMs, or AWS S3, which let you upload blobs (pictures, videos).
\label{sec-1-1-4-2-2}
\item Software provides a human used program, like Dropbox or Youtube.
\label{sec-1-1-4-2-3}
\end{enumerate}
\item Persuasive systems are computers that are everywhere, like sensors or mobile networks.
\label{sec-1-1-4-3}
\begin{enumerate}
\item An extreme is the ubiqutous system, which is everywhere and always connected (think smarthome?)
\label{sec-1-1-4-3-1}
\begin{enumerate}
\item Design requirements include distribution, interaction, context awareness, autonomy, and intelligence.
\label{sec-1-1-4-3-1-1}
\end{enumerate}
\item Mobile networks can make ad hoc wireless networks (MANET), where they act as nodes.
\label{sec-1-1-4-3-2}
\item Sensor networks can either send all their data back, or hold data and respond to queries (save energy).  Or there might be an intermediate processing system.
\label{sec-1-1-4-3-3}
\end{enumerate}
\end{enumerate}
\subsection{Thoughts}
\label{sec-1-2}
\subsubsection{What about the web and REST?  Isn't it the de facto or most popular distributed systems protocol in commerical services / cloud?}
\label{sec-1-2-1}
\begin{enumerate}
\item In the book, Van Steen brought up RPCs and SOAs (server oriented architecture, next chapter), where nodes run functions.  I remember at Walmart working on their backend distributed system, and they were moving away from RPCs which built SOAs.  Instead every service was a ROA (resource oriented architecture) and the server was a RESTful API.
\label{sec-1-2-1-1}
\item So we had microservices communicated with each other through REST.  The way nodes work on the web today is primarily through restful APIs.  Github API.  Facebook API (even though it's graphbased, we query through REST).
\label{sec-1-2-1-2}
\item With startups, we encouraged to use the the cloud (AWS, Firebase) as our platform backend.  And the way the client connects (as a node to the system) is through REST.
\label{sec-1-2-1-3}
\item So how come its not mentioned at all?
\label{sec-1-2-1-4}
\end{enumerate}
\subsubsection{Immutable State.}
\label{sec-1-2-2}
\begin{enumerate}
\item The idea is that every data structure is immutable, so a change in state results in an entirely new state.  With that, you sacrifice some efficiency (allocated new objects or at least a ledger diff) but you have immutable state.  Which makes dealing with concurrency a lot easier.  Managing consistency becomes easier.
\label{sec-1-2-2-1}
\item I know Facebook and their web platform (Redux, Immutable.js) uses it to make ReactJS much easier to develop in.
\label{sec-1-2-2-2}
\item How come we don't see immutable distributed databases out there (Google showed me DAtomic)?
\label{sec-1-2-2-3}
\end{enumerate}
\subsubsection{CAP theorem and ACID and distributed databases.  How do they all work together?}
\label{sec-1-2-3}
\begin{enumerate}
\item Like if we sacrifice C, they by definition our database isn't consistent, so no ACID.
\label{sec-1-2-3-1}
\item So acid distributed databases are either outdated (availablitity) or slow (lack or partition tolerance?)
\label{sec-1-2-3-2}
\item Might be for later\ldots{}
\label{sec-1-2-3-3}
\end{enumerate}
\subsubsection{How is transparency linked with assumptions?}
\label{sec-1-2-4}
\begin{enumerate}
\item In the introduction, Van Steen stated that total transparency (network completely abstracted away) is impossible and sometimes a bad idea.
\label{sec-1-2-4-1}
\item Is that related to the assumptions we make when designing a distributed system?
\label{sec-1-2-4-2}
\item For example: If we have a unreliable network, expose the that part (connections, failure) of and intransparent and let the app / user deal with it
\label{sec-1-2-4-3}
\begin{enumerate}
\item Ex: A website is taking too long to load, so the app displays a loading symbol, so the user understands and can close.
\label{sec-1-2-4-3-1}
\end{enumerate}
\end{enumerate}
\subsubsection{EXTRA: What about microservices?}
\label{sec-1-2-5}
\begin{enumerate}
