notes/week4/textbook/distributed_computing.org
**** Buzzword... I remember reading stuff from Uber and Netflix that they implemented their distributed system architecture with a set of microservices.
**** How do they fit in?  Are they a set of small PaaS cloud service (I'm assuming)?  Or are they a grid system?  I guess it's based on how the microservice is implemented?
**** What's the idea behind them (outside the scope of the reading but...)
