notes/week4/textbook/distributed_computing.tex
\item Buzzword\ldots{} I remember reading stuff from Uber and Netflix that they implemented their distributed system architecture with a set of microservices.
\label{sec-1-2-5-1}
\item How do they fit in?  Are they a set of small PaaS cloud service (I'm assuming)?  Or are they a grid system?  I guess it's based on how the microservice is implemented?
\label{sec-1-2-5-2}
\item What's the idea behind them (outside the scope of the reading but\ldots{})
\label{sec-1-2-5-3}
\end{enumerate}
% Emacs 25.2.1 (Org mode 8.2.10)
\end{document}
